<?xml version="1.0" encoding="utf-8"?>
<search> 
  
    
    <entry>
      <title>&lt;游戏算法&gt;Unity 实现2D游戏中的四叉树空间管理和矩形碰撞检测(2)</title>
      <link href="/2019/MyLearn-QTree2/"/>
      <url>/2019/MyLearn-QTree2/</url>
      

        <content type="html"><![CDATA[<h2 id="为VS中的CPP属性添加一行代码"><a href="#为VS中的CPP属性添加一行代码" class="headerlink" title="为VS中的CPP属性添加一行代码"></a>为VS中的CPP属性添加一行代码</h2><blockquote><p>我们在VS2017中新建一个CPP工程，并新建一个源文件。</p><p>在这个工程中，我们右键属性，在C++那一项的命令行子项中添加以下代码。</p></blockquote><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">/d1 reportAllClassLayout</span><br></pre></td></tr></table></figure><p><img src="https://confusel-images.oss-cn-shenzhen.aliyuncs.com/%E5%8D%9A%E5%AE%A2%E5%9B%BE%E5%BA%93/%E8%99%9A%E5%87%BD%E6%95%B0/%E8%AE%BE%E7%BD%AE.png" alt=""></p><blockquote><p>加上这行代码，可以在编译时，在<strong>输出</strong>窗口输出内存分布的信息。</p></blockquote><h2 id="有虚函数的类与无虚函数的类对比"><a href="#有虚函数的类与无虚函数的类对比" class="headerlink" title="有虚函数的类与无虚函数的类对比"></a>有虚函数的类与无虚函数的类对比</h2><blockquote><p>我们新建两个类，分别为A和B，他们其中一个类拥有虚函数。</p><p>每一个类中有两个整形成员。</p></blockquote><h3 id="代码"><a href="#代码" class="headerlink" title="代码"></a>代码</h3><figure class="highlight c++"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br></pre></td><td class="code"><pre><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">A</span></span></span><br><span class="line"><span class="class">&#123;</span></span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line"><span class="keyword">int</span> a;</span><br><span class="line"><span class="keyword">int</span> b;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">A();</span><br><span class="line">~A();</span><br><span class="line"></span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line"></span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">B</span></span></span><br><span class="line"><span class="class">&#123;</span></span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line"><span class="keyword">int</span> a;</span><br><span class="line"><span class="keyword">int</span> b;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">B();</span><br><span class="line"><span class="keyword">virtual</span> ~B();</span><br><span class="line"><span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">fun</span><span class="params">()</span></span>;</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line"></span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure><blockquote><p>其中B类拥有虚析构函数以及一个普通虚函数。我们生成解决方案，查看输出窗口。</p></blockquote><p><img src="https://confusel-images.oss-cn-shenzhen.aliyuncs.com/%E5%8D%9A%E5%AE%A2%E5%9B%BE%E5%BA%93/%E8%99%9A%E5%87%BD%E6%95%B0/%E5%AF%B9%E6%AF%941.png" alt=""></p><h3 id="解释"><a href="#解释" class="headerlink" title="解释"></a>解释</h3><blockquote><p>从图上往下解释：</p><p>A这个类占用内存中的8个字节。其中有两个成员ab分别占了4个字节，他们的首地址偏移量为0和4。</p><p>B这个类占用内存中的12个字节。其中发现了一个叫vfptr的成员(即虚函数表的指针)占用了4个字节。随后是两个成员ab分别占了4个字节，他们的首地址偏移量为4和8。</p><p>B:: vftavle ，即B作用域中的虚函数表，在这个表中标记了两个虚函数，分别是dtor(destructor析构函数的缩写)，以及fun。</p><p>​    其中，在虚函数表中左边的编号不是占用的字节，而是函数的编号。</p></blockquote><h3 id="分析"><a href="#分析" class="headerlink" title="分析"></a>分析</h3><blockquote><ol><li>从内存分布来看，成员函数无论是否是virtual的，都不在类中，而成员变量则在。(类的非静态成员变量信息在栈上，函数在代码区里)</li><li>当类中存在虚函数的时候，系统会给它分配一个虚函数表，里面记录了这个类拥有的虚函数的指针。</li><li>当类中存在虚函数的时候，系统会给它分配一个虚函数表指针，用来指向2中的虚函数表，而这个虚函数表指针位于其内存的首位。(偏移量为0)</li></ol></blockquote><h2 id="有虚函数类的单继承：重写与不重写"><a href="#有虚函数类的单继承：重写与不重写" class="headerlink" title="有虚函数类的单继承：重写与不重写"></a>有虚函数类的单继承：重写与不重写</h2><blockquote><p>我们定一个基类A，拥有两个整形成员ab，以及虚析构函数和普通虚函数fun。</p><p>定义两个派生类SA1和SA2，它们各自拥有一个新整形成员c，其中SA2重写了基类A中的fun以及自己的析构函数。</p></blockquote><figure class="highlight c++"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br></pre></td><td class="code"><pre><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">A</span></span></span><br><span class="line"><span class="class">&#123;</span></span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line"><span class="keyword">int</span> a;</span><br><span class="line"><span class="keyword">int</span> b;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line"><span class="keyword">virtual</span> ~A()&#123;&#125;</span><br><span class="line"><span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">fun</span><span class="params">()</span></span>&#123;&#125;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">SA1</span> :</span><span class="keyword">public</span> A</span><br><span class="line">&#123;</span><br><span class="line"><span class="keyword">private</span> :</span><br><span class="line"><span class="keyword">int</span> c;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">SA2</span> :</span><span class="keyword">public</span>  A</span><br><span class="line">&#123;</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line"><span class="keyword">int</span> c;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line"><span class="keyword">virtual</span> ~SA2()&#123;&#125;</span><br><span class="line"><span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">fun</span><span class="params">()</span></span>&#123;&#125;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure><blockquote><p>查看输出窗口</p></blockquote><p><img src="https://confusel-images.oss-cn-shenzhen.aliyuncs.com/%E5%8D%9A%E5%AE%A2%E5%9B%BE%E5%BA%93/%E8%99%9A%E5%87%BD%E6%95%B0/%E5%AF%B9%E6%AF%942.png" alt=""></p><h3 id="解释-1"><a href="#解释-1" class="headerlink" title="解释"></a>解释</h3><blockquote><p>从图上往下解释：</p><p>SA1这个类占用内存中的16个字节。其中先排布了基类A的成员信息，与上面第一张图一样，分别是虚函数表指针、成员a、b，分别占用4字节。随后是排布SA1自己的整形成员c，占用字节4。</p><p>随后是SA1的虚函数表，可以看到，虚函数表中的fun函数作用域是基类A。而析构函数是SA1本身。(C++中的类会默认帮你生成四个默认函数：构造、析构、浅拷贝、赋值(返回浅拷贝)，如果你自己实现了，则不会再生成)</p><p>SA2这个类占用内存中的16个字节。内容排版和SA1一样。</p><p>随后是SA1的虚函数表，可以看到，虚函数表中的函数作用域都是是SA2本身。</p><p>因为我们重写了基类的虚函数。</p></blockquote><h3 id="分析-1"><a href="#分析-1" class="headerlink" title="分析"></a>分析</h3><blockquote><ol><li><p>派生类在内存的分布上，首先排布自己的基类成员信息，包含基类的虚函数表指针。基类成员信息的排版顺序和基类自身的一致。    </p><p>​    随后才是自己的成员信息。</p></li><li><p>内存会为拥有虚函数的基类的派生类再生成一个虚函数表，里面指名了虚函数，如果重写了虚函数，则会被覆盖。</p></li><li><p>内存中存储基类信息中的虚函数指针不再指向基类的虚函数表，而是自己的虚函数表。</p></li></ol></blockquote><h2 id="有虚函数基类的多重继承"><a href="#有虚函数基类的多重继承" class="headerlink" title="有虚函数基类的多重继承"></a>有虚函数基类的多重继承</h2><blockquote><p>多重继承就是爷爷-&gt;爸爸-&gt;儿子。简单理解为一条从上到下的线性继承。</p><p>我们定义三个类，也有这样的继承关系：A-&gt;B&gt;C。</p><p>其中A有虚函数fun和fun1。</p><p>B有虚函数fun2并重写虚函数fun1。</p><p>C重写虚函数fun、fun1、fun2.</p></blockquote><figure class="highlight c++"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br></pre></td><td class="code"><pre><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">A</span></span></span><br><span class="line"><span class="class">&#123;</span></span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line"><span class="keyword">int</span> a;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line"><span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">fun</span><span class="params">()</span></span>&#123;&#125;</span><br><span class="line"><span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">fun1</span><span class="params">()</span></span>&#123;&#125;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">B</span> :</span><span class="keyword">public</span> A</span><br><span class="line">&#123;</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line"><span class="keyword">int</span> b;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line"><span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">fun1</span><span class="params">()</span></span>&#123;&#125;</span><br><span class="line"><span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">fun2</span><span class="params">()</span></span>&#123;&#125;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">C</span> :</span><span class="keyword">public</span> B</span><br><span class="line">&#123;</span><br><span class="line"><span class="keyword">private</span>:</span><br><span class="line"><span class="keyword">int</span> c;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line"><span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">fun</span><span class="params">()</span></span>&#123;&#125;</span><br><span class="line"><span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">fun2</span><span class="params">()</span></span>&#123;&#125;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure><blockquote><p>因为输出窗口截图太长了，所以直接赋值上来了</p></blockquote><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br></pre></td><td class="code"><pre><span class="line">1&gt;class Asize(8):</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt; 0| &#123;vfptr&#125;</span><br><span class="line">1&gt; 4| a</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;A::$vftable@:</span><br><span class="line">1&gt;| &amp;A_meta</span><br><span class="line">1&gt;|  0</span><br><span class="line">1&gt; 0| &amp;A::fun</span><br><span class="line">1&gt; 1| &amp;A::fun1</span><br><span class="line"></span><br><span class="line">...</span><br><span class="line"></span><br><span class="line">1&gt;class Bsize(12):</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt; 0| +--- (base class A)</span><br><span class="line">1&gt; 0| | &#123;vfptr&#125;</span><br><span class="line">1&gt; 4| | a</span><br><span class="line">1&gt;| +---</span><br><span class="line">1&gt; 8| b</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;B::$vftable@:</span><br><span class="line">1&gt;| &amp;B_meta</span><br><span class="line">1&gt;|  0</span><br><span class="line">1&gt; 0| &amp;A::fun</span><br><span class="line">1&gt; 1| &amp;B::fun1</span><br><span class="line">1&gt; 2| &amp;B::fun2</span><br><span class="line"></span><br><span class="line">...</span><br><span class="line"></span><br><span class="line">1&gt;class Csize(16):</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt; 0| +--- (base class B)</span><br><span class="line">1&gt; 0| | +--- (base class A)</span><br><span class="line">1&gt; 0| | | &#123;vfptr&#125;</span><br><span class="line">1&gt; 4| | | a</span><br><span class="line">1&gt;| | +---</span><br><span class="line">1&gt; 8| | b</span><br><span class="line">1&gt;| +---</span><br><span class="line">1&gt;12| c</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;C::$vftable@:</span><br><span class="line">1&gt;| &amp;C_meta</span><br><span class="line">1&gt;|  0</span><br><span class="line">1&gt; 0| &amp;C::fun</span><br><span class="line">1&gt; 1| &amp;B::fun1</span><br><span class="line">1&gt; 2| &amp;C::fun2</span><br></pre></td></tr></table></figure><h3 id="解释-2"><a href="#解释-2" class="headerlink" title="解释"></a>解释</h3><blockquote><ol><li><p>基类A占用8个字节，分别是虚函数表指针和成员a。</p><p>​    在虚函数表中，函数fun和fun1作用域都属于自己。</p></li><li><p>派生类B占用12个字节，分别是基类A的虚函数表指针和成员a。加上自己的成员b。其中虚函数表指针指向自己的虚函数表而不是基类A。</p><p>​    在虚函数表中，因为重写了虚函数fun1，并且新增一个虚函数fun2，基类A的虚函数fun的作用域属于A。</p></li><li><p>派生类C占用16个字节，分别是基类A的虚函数表指针和成员a。和基类B的成员b，加上自己的成员c。其中虚函数表指针指向自己的虚函数表而不是基类B。</p><p>​    在虚函数表中，因为重写了基类的所有的虚函数fun、2，作用域都是自己。保留未重写的虚函数fun1。因为fun1来自基类B，而B重写了来自基类A的虚函数fun1，所以在C中，fun1依然属于B类。</p></li></ol></blockquote><h3 id="分析-2"><a href="#分析-2" class="headerlink" title="分析"></a>分析</h3><blockquote><ol><li>虚函数表中只会记录基类的虚函数地址(或被重写的)，以及自己的新虚函数地址。</li><li>可以理解虚函数表中记录的虚函数地址都是相对于当前类最新的虚函数(即只要被重写的虚函数，都会替代)。</li></ol></blockquote><h2 id="多继承与虚继承"><a href="#多继承与虚继承" class="headerlink" title="多继承与虚继承"></a>多继承与虚继承</h2><h3 id="多继承的二义性"><a href="#多继承的二义性" class="headerlink" title="多继承的二义性"></a>多继承的二义性</h3><blockquote><p>JAVA中没有多继承，为何？因为多继承容易造成二义性。</p><p>我们来看看下面的代码。</p><p>创建了三个基类ABC，其中ABC都有相同名字的虚函数fun以及相同名字的char类型成员x。</p></blockquote><figure class="highlight c++"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br></pre></td><td class="code"><pre><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">A</span></span></span><br><span class="line"><span class="class">&#123;</span></span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line"><span class="keyword">char</span> x = <span class="string">'A'</span>;</span><br><span class="line"><span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">fun</span><span class="params">()</span>  </span></span><br><span class="line"><span class="function"></span>&#123;</span><br><span class="line"><span class="built_in">cout</span> &lt;&lt; <span class="string">"来自A的fun"</span> &lt;&lt; <span class="built_in">endl</span>;</span><br><span class="line">&#125;</span><br><span class="line"><span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">funA</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">B</span></span></span><br><span class="line"><span class="class">&#123;</span></span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line"><span class="keyword">char</span> x = <span class="string">'B'</span>;</span><br><span class="line"><span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">fun</span><span class="params">()</span></span></span><br><span class="line"><span class="function"></span>&#123;</span><br><span class="line"><span class="built_in">cout</span> &lt;&lt; <span class="string">"来自B的fun"</span> &lt;&lt; <span class="built_in">endl</span>;</span><br><span class="line">&#125;</span><br><span class="line"><span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">funB</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">C</span></span></span><br><span class="line"><span class="class">&#123;</span></span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line"><span class="keyword">char</span> x = <span class="string">'C'</span>;</span><br><span class="line"><span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">fun</span><span class="params">()</span></span></span><br><span class="line"><span class="function"></span>&#123;</span><br><span class="line"><span class="built_in">cout</span> &lt;&lt; <span class="string">"来自C的fun"</span> &lt;&lt; <span class="built_in">endl</span>;</span><br><span class="line">&#125;</span><br><span class="line"><span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">funC</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">Son</span> :</span> A,  B,  C</span><br><span class="line">&#123;</span><br><span class="line"><span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">funSon</span><span class="params">()</span></span>&#123;&#125;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure><blockquote><p>我们再创建了一个派生类Son，多继承于A,B,C。</p><p>这个时候我们通过Son对象去访问fun函数和x成员会发生什么？</p></blockquote><p><img src="https://confusel-images.oss-cn-shenzhen.aliyuncs.com/%E5%8D%9A%E5%AE%A2%E5%9B%BE%E5%BA%93/%E8%99%9A%E5%87%BD%E6%95%B0/%E5%A4%9A%E7%BB%A7%E6%89%BF%E5%AF%BC%E8%87%B4%E7%9A%84%E4%B8%8D%E6%98%8E%E7%A1%AE.png" alt=""></p><blockquote><p>不说编译器，就算是写出代码的我们，也不知道这个Son到底是指谁。</p><p>那我们向上转换呢，结果是当然，因为我们告诉了编译器，我们想要谁的函数和成员。</p></blockquote><p><img src="https://confusel-images.oss-cn-shenzhen.aliyuncs.com/%E5%8D%9A%E5%AE%A2%E5%9B%BE%E5%BA%93/%E8%99%9A%E5%87%BD%E6%95%B0/%E5%90%91%E4%B8%8A%E8%BD%AC%E6%8D%A2%E4%B8%8D%E5%86%8D%E6%8A%A5%E9%94%99.png" alt=""></p><center>向上转换后不再报错</center><p><img src="https://confusel-images.oss-cn-shenzhen.aliyuncs.com/%E5%8D%9A%E5%AE%A2%E5%9B%BE%E5%BA%93/%E8%99%9A%E5%87%BD%E6%95%B0/%E5%90%91%E4%B8%8A%E8%BD%AC%E6%8D%A2%E7%9A%84%E7%BB%93%E6%9E%9C.png" alt=""></p><center>正确输出结果</center><blockquote><p>好，我们已经领略到多继承因同名而引发的二义性。这个时候我们看看这段代码在内存中的分布如何。</p></blockquote><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br><span class="line">52</span><br><span class="line">53</span><br><span class="line">54</span><br><span class="line">55</span><br><span class="line">56</span><br><span class="line">57</span><br><span class="line">58</span><br><span class="line">59</span><br><span class="line">60</span><br><span class="line">61</span><br><span class="line">62</span><br><span class="line">63</span><br><span class="line">64</span><br><span class="line">65</span><br><span class="line">66</span><br><span class="line">67</span><br><span class="line">68</span><br><span class="line">69</span><br><span class="line">70</span><br><span class="line">71</span><br><span class="line">72</span><br><span class="line">73</span><br><span class="line">74</span><br><span class="line">75</span><br><span class="line">76</span><br><span class="line">77</span><br><span class="line">78</span><br><span class="line">79</span><br><span class="line">80</span><br></pre></td><td class="code"><pre><span class="line">1&gt;class Asize(8):</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt; 0| &#123;vfptr&#125;</span><br><span class="line">1&gt; 4| x</span><br><span class="line">1&gt;  | &lt;alignment member&gt; (size=3)</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;A::$vftable@:</span><br><span class="line">1&gt;| &amp;A_meta</span><br><span class="line">1&gt;|  0</span><br><span class="line">1&gt; 0| &amp;A::fun</span><br><span class="line">1&gt; 1| &amp;A::funA</span><br><span class="line"></span><br><span class="line">...</span><br><span class="line"></span><br><span class="line">1&gt;class Bsize(8):</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt; 0| &#123;vfptr&#125;</span><br><span class="line">1&gt; 4| x</span><br><span class="line">1&gt;  | &lt;alignment member&gt; (size=3)</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;B::$vftable@:</span><br><span class="line">1&gt;| &amp;B_meta</span><br><span class="line">1&gt;|  0</span><br><span class="line">1&gt; 0| &amp;B::fun</span><br><span class="line">1&gt; 1| &amp;B::funB</span><br><span class="line"></span><br><span class="line">...</span><br><span class="line"></span><br><span class="line">1&gt;class Csize(8):</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt; 0| &#123;vfptr&#125;</span><br><span class="line">1&gt; 4| x</span><br><span class="line">1&gt;  | &lt;alignment member&gt; (size=3)</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;C::$vftable@:</span><br><span class="line">1&gt;| &amp;C_meta</span><br><span class="line">1&gt;|  0</span><br><span class="line">1&gt; 0| &amp;C::fun</span><br><span class="line">1&gt; 1| &amp;C::funC</span><br><span class="line"></span><br><span class="line">...</span><br><span class="line"></span><br><span class="line">1&gt;class Sonsize(24):</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt; 0| +--- (base class A)</span><br><span class="line">1&gt; 0| | &#123;vfptr&#125;</span><br><span class="line">1&gt; 4| | x</span><br><span class="line">1&gt;  | | &lt;alignment member&gt; (size=3)</span><br><span class="line">1&gt;| +---</span><br><span class="line">1&gt; 8| +--- (base class B)</span><br><span class="line">1&gt; 8| | &#123;vfptr&#125;</span><br><span class="line">1&gt;12| | x</span><br><span class="line">1&gt;  | | &lt;alignment member&gt; (size=3)</span><br><span class="line">1&gt;| +---</span><br><span class="line">1&gt;16| +--- (base class C)</span><br><span class="line">1&gt;16| | &#123;vfptr&#125;</span><br><span class="line">1&gt;20| | x</span><br><span class="line">1&gt;  | | &lt;alignment member&gt; (size=3)</span><br><span class="line">1&gt;| +---</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;Son::$vftable@A@:</span><br><span class="line">1&gt;| &amp;Son_meta</span><br><span class="line">1&gt;|  0</span><br><span class="line">1&gt; 0| &amp;A::fun</span><br><span class="line">1&gt; 1| &amp;A::funA</span><br><span class="line">1&gt; 2| &amp;Son::funSon</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;Son::$vftable@B@:</span><br><span class="line">1&gt;| -8</span><br><span class="line">1&gt; 0| &amp;B::fun</span><br><span class="line">1&gt; 1| &amp;B::funB</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;Son::$vftable@C@:</span><br><span class="line">1&gt;| -16</span><br><span class="line">1&gt; 0| &amp;C::fun</span><br><span class="line">1&gt; 1| &amp;C::funC</span><br></pre></td></tr></table></figure><h4 id="解释-3"><a href="#解释-3" class="headerlink" title="解释"></a>解释</h4><blockquote><p>基类ABC不再多解释。</p><p>我们直接看派生类Son，在内存中，基类的信息按照多继承时的左到右的顺序排序，也就是A-&gt;B-&gt;C。</p><p>每一个基类成员中，都包含有指向对应虚函数表的指针以及一个char成员x。</p><p>然后有一段  <alignment member=""> (size=3)  的代码。在这里解释一下，是补充了3个字节的意思。</alignment></p><p>(为什么是三个字节，因为在整个基类成员中，占位最大的是虚函数表指针，即4个字节，那么我们就需要按照它去对齐，所以在占有一个字节的char后面补充了三个字节，这是内存对齐的知识点)</p><p>随后是三张虚函数表，偏移量从0到-8再到-16。三张表中的虚函数地址都指对应自己类中的虚函数。</p><p>在第一个虚函数表中，多出了派生类的新虚函数。</p></blockquote><h4 id="分析-3"><a href="#分析-3" class="headerlink" title="分析"></a>分析</h4><blockquote><p>在派生类对象调用相同名字的虚函数时，会产生二义性，编译器无法知道我们到底想调用哪一个虚函数表指针的虚函数。而向上转换后，明确的告诉编译器我们调用的虚函数指针是哪个基类成员中的，这样就能正确调用那个基类的虚函数。</p><p>派生类新增虚函数，放在声明的第一个基类的虚函数表中</p></blockquote><h4 id="重写多继承中的虚函数"><a href="#重写多继承中的虚函数" class="headerlink" title="重写多继承中的虚函数"></a>重写多继承中的虚函数</h4><blockquote><p>我们将上面的代码改成这样：重写Son中对ABC的虚函数fun</p></blockquote><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br></pre></td><td class="code"><pre><span class="line">class Son : A, B, C</span><br><span class="line">&#123;</span><br><span class="line">virtual void fun()</span><br><span class="line">&#123;</span><br><span class="line">cout &lt;&lt; &quot;来自Son的fun&quot; &lt;&lt; endl;</span><br><span class="line">&#125;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure><blockquote><p>查看内存分布：</p></blockquote><p><img src="https://confusel-images.oss-cn-shenzhen.aliyuncs.com/%E5%8D%9A%E5%AE%A2%E5%9B%BE%E5%BA%93/%E8%99%9A%E5%87%BD%E6%95%B0/%E9%87%8D%E5%86%99%E5%A4%9A%E7%BB%A7%E6%89%BF.png" alt=""></p><blockquote><p>我们发现，派生类中对应基类A的虚表（虚函数表）的fun已经改变，作用域为Son。</p><p>而虚表B、C中的fun虚函数指针已经了一个goto语句，即将内存偏移x位到达虚表A，从A中读取fun函数。(编译器多聪明，不需要另建指针)。</p></blockquote><hr><h3 id="虚继承"><a href="#虚继承" class="headerlink" title="虚继承"></a>虚继承</h3><blockquote><p>虚继承就是在继承时候在基类名字前加上 virtual 关键字。</p></blockquote><h4 id="没有虚函数的虚继承多重继承-包含单继承"><a href="#没有虚函数的虚继承多重继承-包含单继承" class="headerlink" title="没有虚函数的虚继承多重继承(包含单继承)"></a>没有虚函数的虚继承多重继承(包含单继承)</h4><figure class="highlight c++"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br></pre></td><td class="code"><pre><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">A</span></span></span><br><span class="line"><span class="class">&#123;</span></span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line"><span class="keyword">int</span> x;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">B</span> :</span><span class="keyword">virtual</span> A</span><br><span class="line">&#123;</span><br><span class="line"><span class="keyword">int</span> y;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">C</span> :</span><span class="keyword">virtual</span> B</span><br><span class="line">&#123;</span><br><span class="line"><span class="keyword">int</span> z;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br></pre></td><td class="code"><pre><span class="line">1&gt;class Asize(4):</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt; 0| x</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;class Bsize(12):</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt; 0| &#123;vbptr&#125;</span><br><span class="line">1&gt; 4| y</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt;+--- (virtual base A)</span><br><span class="line">1&gt; 8| x</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;B::$vbtable@:</span><br><span class="line">1&gt; 0| 0</span><br><span class="line">1&gt; 1| 8 (Bd(B+0)A)</span><br><span class="line">1&gt;vbi:   class  offset o.vbptr  o.vbte fVtorDisp</span><br><span class="line">1&gt;               A       8       0       4 0</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;class Csize(20):</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt; 0| &#123;vbptr&#125;</span><br><span class="line">1&gt; 4| z</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt;+--- (virtual base A)</span><br><span class="line">1&gt; 8| x</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt;+--- (virtual base B)</span><br><span class="line">1&gt;12| &#123;vbptr&#125;</span><br><span class="line">1&gt;16| y</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;C::$vbtable@C@:</span><br><span class="line">1&gt; 0| 0</span><br><span class="line">1&gt; 1| 8 (Cd(C+0)A)</span><br><span class="line">1&gt; 2| 12 (Cd(C+0)B)</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;C::$vbtable@B@:</span><br><span class="line">1&gt; 0| 0</span><br><span class="line">1&gt; 1| -4 (Cd(B+0)A)</span><br><span class="line">1&gt;vbi:   class  offset o.vbptr  o.vbte fVtorDisp</span><br><span class="line">1&gt;               A       8       0       4 0</span><br><span class="line">1&gt;               B      12       0       8 0</span><br></pre></td></tr></table></figure><h6 id="解释-4"><a href="#解释-4" class="headerlink" title="解释"></a>解释</h6><blockquote><p>基类A占四个字节，即自身成员x。</p><p>派生类B占8个字节，多了一个vbptr(虚基表指针)的指针，随后是自己的成员y，才到A类中的成员x。</p><p>vbtable字段中的值代表访问某个虚基表的内存偏移量。</p><p>vbi字段：</p><p>class ：虚基表的类名</p><p>offset：内存偏移量</p><p>vbptr：虚基表指针位置</p><p>vbte：母鸡0 0</p><p>fvtorDisp: 下面引用于<a href="https://www.cnblogs.com/fanzhidongyzby/archive/2013/01/14/2860015.html">关于vtordisp知多少？</a></p><hr><p>MSDN给出的解释是：<strong>虚继承中派生类重写了基类的虚函数，并且在构造函数或者析构函数中使用指向基类的指针调用了该函数，编译器会为虚基类添fVtorDisp域。</strong></p><p>然而，经过VS2010的测试，我们发现上述示例代码便会产生vtordisp字段！条件是。</p><ol><li><p>派生类重写了虚基类的虚函数。</p></li><li><p>派生类定义了构造函数或者析构函数。</p></li></ol><hr></blockquote><h6 id="分析-4"><a href="#分析-4" class="headerlink" title="分析"></a>分析</h6><blockquote><p>我们看到，只要虚继承于一个基类，就会为其创建一个虚基表，并且在内存首部生成一个虚基表指针。</p><p>而且，派生类的成员变量内存分布永远在前面(在虚基表指针的后面)，其次是基类的基类成员(如果有)，再到基类的成员。</p><p>下面引用于<a href="https://www.cnblogs.com/yanqi0124/p/3830433.html">C++ 继承之虚继承与普通继承的内存分布</a></p><hr><ol><li>普通继承情况下，先父类元素后子类元素，若父类元素本身也是从某个爷爷类继承而来：父类是虚继承而来，则先父后子再爷爷（其实这个分布是满足规则2的）,即爷爷放在最后；父类是普通继承而来，先爷爷后父再子，即爷爷放在前面。</li><li>虚继承情况下，先子类元素后父类元素，如果父类元素本身也是从某个爷爷类继承（不论是虚继承还是普通继承）而来，则父类由类的深到浅依次分布（先爷爷后父，爷爷在子和父之间）。</li></ol><hr></blockquote><h4 id="有虚函数的虚继承多重继承-包含单继承"><a href="#有虚函数的虚继承多重继承-包含单继承" class="headerlink" title="有虚函数的虚继承多重继承(包含单继承)"></a>有虚函数的虚继承多重继承(包含单继承)</h4><blockquote><p>新建三个基类ABC，每个基类拥有自己不同名的成员变量。每个基类都有自己的虚函数。</p><p>ABC父子关系为A-&gt;B-&gt;C。</p><p>其中BC重写A的虚函数fun。</p><p>派生类D重写所有虚函数。</p></blockquote><figure class="highlight c++"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br></pre></td><td class="code"><pre><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">A</span></span></span><br><span class="line"><span class="class">&#123;</span></span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line"><span class="keyword">int</span> a;</span><br><span class="line"><span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">fun</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"><span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">funA</span><span class="params">()</span></span>&#123;&#125;;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">B</span> :</span><span class="keyword">virtual</span> A</span><br><span class="line">&#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line"><span class="keyword">int</span> b;</span><br><span class="line"><span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">fun</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"><span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">funB</span><span class="params">()</span> </span>&#123;&#125;;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">C</span> :</span><span class="keyword">virtual</span> B</span><br><span class="line">&#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line"><span class="keyword">int</span> c;</span><br><span class="line"><span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">fun</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"><span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">funC</span><span class="params">()</span> </span>&#123;&#125;;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">D</span> :</span><span class="keyword">virtual</span> C</span><br><span class="line">&#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line"><span class="keyword">int</span> d;</span><br><span class="line"><span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">fun</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"><span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">funA</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"><span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">funB</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"><span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">funC</span><span class="params">()</span> </span>&#123;&#125;;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br><span class="line">52</span><br><span class="line">53</span><br><span class="line">54</span><br><span class="line">55</span><br><span class="line">56</span><br><span class="line">57</span><br><span class="line">58</span><br><span class="line">59</span><br><span class="line">60</span><br><span class="line">61</span><br><span class="line">62</span><br><span class="line">63</span><br><span class="line">64</span><br><span class="line">65</span><br><span class="line">66</span><br><span class="line">67</span><br><span class="line">68</span><br><span class="line">69</span><br><span class="line">70</span><br><span class="line">71</span><br><span class="line">72</span><br><span class="line">73</span><br><span class="line">74</span><br><span class="line">75</span><br><span class="line">76</span><br><span class="line">77</span><br><span class="line">78</span><br><span class="line">79</span><br><span class="line">80</span><br><span class="line">81</span><br><span class="line">82</span><br><span class="line">83</span><br><span class="line">84</span><br><span class="line">85</span><br><span class="line">86</span><br><span class="line">87</span><br><span class="line">88</span><br><span class="line">89</span><br><span class="line">90</span><br><span class="line">91</span><br><span class="line">92</span><br><span class="line">93</span><br><span class="line">94</span><br><span class="line">95</span><br><span class="line">96</span><br><span class="line">97</span><br><span class="line">98</span><br><span class="line">99</span><br><span class="line">100</span><br><span class="line">101</span><br><span class="line">102</span><br><span class="line">103</span><br><span class="line">104</span><br><span class="line">105</span><br><span class="line">106</span><br><span class="line">107</span><br><span class="line">108</span><br><span class="line">109</span><br><span class="line">110</span><br><span class="line">111</span><br><span class="line">112</span><br><span class="line">113</span><br><span class="line">114</span><br><span class="line">115</span><br><span class="line">116</span><br><span class="line">117</span><br><span class="line">118</span><br><span class="line">119</span><br><span class="line">120</span><br><span class="line">121</span><br><span class="line">122</span><br><span class="line">123</span><br><span class="line">124</span><br><span class="line">125</span><br><span class="line">126</span><br><span class="line">127</span><br><span class="line">128</span><br><span class="line">129</span><br><span class="line">130</span><br><span class="line">131</span><br><span class="line">132</span><br><span class="line">133</span><br><span class="line">134</span><br><span class="line">135</span><br></pre></td><td class="code"><pre><span class="line">1&gt;class Asize(8):</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt; 0| &#123;vfptr&#125;</span><br><span class="line">1&gt; 4| a</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;A::$vftable@:</span><br><span class="line">1&gt;| &amp;A_meta</span><br><span class="line">1&gt;|  0</span><br><span class="line">1&gt; 0| &amp;A::fun</span><br><span class="line">1&gt; 1| &amp;A::funA</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;class Bsize(20):</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt; 0| &#123;vfptr&#125;</span><br><span class="line">1&gt; 4| &#123;vbptr&#125;</span><br><span class="line">1&gt; 8| b</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt;+--- (virtual base A)</span><br><span class="line">1&gt;12| &#123;vfptr&#125;</span><br><span class="line">1&gt;16| a</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;B::$vftable@B@:</span><br><span class="line">1&gt;| &amp;B_meta</span><br><span class="line">1&gt;|  0</span><br><span class="line">1&gt; 0| &amp;B::funB</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;B::$vbtable@:</span><br><span class="line">1&gt; 0| -4</span><br><span class="line">1&gt; 1| 8 (Bd(B+4)A)</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;B::$vftable@A@:</span><br><span class="line">1&gt;| -12</span><br><span class="line">1&gt; 0| &amp;B::fun</span><br><span class="line">1&gt; 1| &amp;A::funA</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;vbi:   class  offset o.vbptr  o.vbte fVtorDisp</span><br><span class="line">1&gt;               A      12       4       4 0</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;class Csize(32):</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt; 0| &#123;vfptr&#125;</span><br><span class="line">1&gt; 4| &#123;vbptr&#125;</span><br><span class="line">1&gt; 8| c</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt;+--- (virtual base A)</span><br><span class="line">1&gt;12| &#123;vfptr&#125;</span><br><span class="line">1&gt;16| a</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt;+--- (virtual base B)</span><br><span class="line">1&gt;20| &#123;vfptr&#125;</span><br><span class="line">1&gt;24| &#123;vbptr&#125;</span><br><span class="line">1&gt;28| b</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;C::$vftable@:</span><br><span class="line">1&gt;| &amp;C_meta</span><br><span class="line">1&gt;|  0</span><br><span class="line">1&gt; 0| &amp;C::funC</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;C::$vbtable@C@:</span><br><span class="line">1&gt; 0| -4</span><br><span class="line">1&gt; 1| 8 (Cd(C+4)A)</span><br><span class="line">1&gt; 2| 16 (Cd(C+4)B)</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;C::$vftable@A@:</span><br><span class="line">1&gt;| -12</span><br><span class="line">1&gt; 0| &amp;C::fun</span><br><span class="line">1&gt; 1| &amp;A::funA</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;C::$vftable@B@:</span><br><span class="line">1&gt;| -20</span><br><span class="line">1&gt; 0| &amp;B::funB</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;C::$vbtable@B@:</span><br><span class="line">1&gt; 0| -4</span><br><span class="line">1&gt; 1| -12 (Cd(B+4)A)</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;vbi:   class  offset o.vbptr  o.vbte fVtorDisp</span><br><span class="line">1&gt;               A      12       4       4 0</span><br><span class="line">1&gt;               B      20       4       8 0</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;class Dsize(40):</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt; 0| &#123;vbptr&#125;</span><br><span class="line">1&gt; 4| d</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt;+--- (virtual base A)</span><br><span class="line">1&gt; 8| &#123;vfptr&#125;</span><br><span class="line">1&gt;12| a</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt;+--- (virtual base B)</span><br><span class="line">1&gt;16| &#123;vfptr&#125;</span><br><span class="line">1&gt;20| &#123;vbptr&#125;</span><br><span class="line">1&gt;24| b</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt;+--- (virtual base C)</span><br><span class="line">1&gt;28| &#123;vfptr&#125;</span><br><span class="line">1&gt;32| &#123;vbptr&#125;</span><br><span class="line">1&gt;36| c</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;D::$vbtable@:</span><br><span class="line">1&gt; 0| 0</span><br><span class="line">1&gt; 1| 8 (Dd(D+0)A)</span><br><span class="line">1&gt; 2| 16 (Dd(D+0)B)</span><br><span class="line">1&gt; 3| 28 (Dd(D+0)C)</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;D::$vftable@A@:</span><br><span class="line">1&gt;| -8</span><br><span class="line">1&gt; 0| &amp;D::fun</span><br><span class="line">1&gt; 1| &amp;D::funA</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;D::$vftable@B@:</span><br><span class="line">1&gt;| -16</span><br><span class="line">1&gt; 0| &amp;D::funB</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;D::$vbtable@B@:</span><br><span class="line">1&gt; 0| -4</span><br><span class="line">1&gt; 1| -12 (Dd(B+4)A)</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;D::$vftable@:</span><br><span class="line">1&gt;| -28</span><br><span class="line">1&gt; 0| &amp;D::funC</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;D::$vbtable@C@:</span><br><span class="line">1&gt; 0| -4</span><br><span class="line">1&gt; 1| -24 (Dd(C+4)A)</span><br><span class="line">1&gt; 2| -16 (Dd(C+4)B)</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;vbi:   class  offset o.vbptr  o.vbte fVtorDisp</span><br><span class="line">1&gt;               A       8       0       4 0</span><br><span class="line">1&gt;               B      16       0       8 0</span><br><span class="line">1&gt;               C      28       0      12 0</span><br></pre></td></tr></table></figure><h5 id="解释-5"><a href="#解释-5" class="headerlink" title="解释"></a>解释</h5><blockquote><p>A因为没有虚继承，有虚函数，所以拥有一个虚函数表指针以及虚函数表，</p><p>B因为虚继承于A，拥有虚基表以及虚基表、虚函数表指针以及基类成员，因为是虚继承且有新的虚函数，所以拥有一个自己虚函数表以及指针。</p><p>​    其中基类的虚函数表记录从基类继承的虚函数地址，即使以被自己重写。</p><p>​    自己的虚函数表仅记录自己的新增虚函数地址。</p><p>C因为虚继承于B，拥有虚基表以及虚基表、虚函数表指针以及基类成员，因为是虚继承且有新的虚函数，所以拥有一个自己虚函数表以及指针。</p><p>​    因为B也是虚继承于A，所以在派生类C的内存中B的成员信息中拥有对应的虚基表指针。</p><p>​    其中基类的虚函数表记录从基类继承的虚函数地址，即使以被自己重写。</p><p>​    自己的虚函数表仅记录自己的新增虚函数地址。</p></blockquote><h5 id="疑问"><a href="#疑问" class="headerlink" title="疑问"></a>疑问</h5><blockquote><p>D也如此，但是在VS输出的信息中，D却拥有了自己的虚函数表地址，并且有一个虚函数地址是指向基类C的函数funC。。 (上述的  D::\$vftable@:    ， 不应该是  D::\$vftable@c@:么)</p><p>但是通过VS断点去查看局部变量的地址，发现D是没有自己的虚函数地址的，而D中C类成员的虚函数表指针可以看到funC。所以可能是VS抽风了？</p></blockquote><p><img src="https://confusel-images.oss-cn-shenzhen.aliyuncs.com/%E5%8D%9A%E5%AE%A2%E5%9B%BE%E5%BA%93/%E8%99%9A%E5%87%BD%E6%95%B0/VS%E6%8A%BD%E9%A3%8E.png" alt=""></p><h5 id="分析-5"><a href="#分析-5" class="headerlink" title="分析"></a>分析</h5><blockquote><p>不难看出，虚继承很智能的把虚函数的起源分开了，也就是很智能的将虚函数指针放在第一个提出某个虚函数的基类虚函数表中。</p></blockquote><h4 id="虚基表的作用：菱形继承问题"><a href="#虚基表的作用：菱形继承问题" class="headerlink" title="虚基表的作用：菱形继承问题"></a>虚基表的作用：菱形继承问题</h4><blockquote><p>有下面的代码</p></blockquote><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br></pre></td><td class="code"><pre><span class="line"></span><br><span class="line">class A</span><br><span class="line">&#123;</span><br><span class="line">public:</span><br><span class="line">int a;</span><br><span class="line">&#125;;</span><br><span class="line">class B :  public A</span><br><span class="line">&#123;</span><br><span class="line">public:</span><br><span class="line">int b;</span><br><span class="line">&#125;;</span><br><span class="line">class C :   public A</span><br><span class="line">&#123;</span><br><span class="line">public:</span><br><span class="line">int c;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line">class D :public B, public C</span><br><span class="line">&#123;</span><br><span class="line"></span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure><blockquote><p>如果我们尝试访问D类的对象中的a成员，会发生什么事情呢。</p></blockquote><p><img src="https://confusel-images.oss-cn-shenzhen.aliyuncs.com/%E5%8D%9A%E5%AE%A2%E5%9B%BE%E5%BA%93/%E8%99%9A%E5%87%BD%E6%95%B0/%E8%8F%B1%E5%BD%A2%E7%BB%A7%E6%89%BF%E9%97%AE%E9%A2%98.png" alt=""></p><blockquote><p>很显然产生了二义性，因为B和C都继承有A的成员a，我们多继承于BC，那么这两个a，编译器不知道到底选谁。</p><p>让我们看看内存排布：</p></blockquote><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br></pre></td><td class="code"><pre><span class="line">1&gt;class Asize(4):</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt; 0| a</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;class Bsize(8):</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt; 0| +--- (base class A)</span><br><span class="line">1&gt; 0| | a</span><br><span class="line">1&gt;| +---</span><br><span class="line">1&gt; 4| b</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;class Csize(8):</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt; 0| +--- (base class A)</span><br><span class="line">1&gt; 0| | a</span><br><span class="line">1&gt;| +---</span><br><span class="line">1&gt; 4| c</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;class Dsize(16):</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt; 0| +--- (base class B)</span><br><span class="line">1&gt; 0| | +--- (base class A)</span><br><span class="line">1&gt; 0| | | a</span><br><span class="line">1&gt;| | +---</span><br><span class="line">1&gt; 4| | b</span><br><span class="line">1&gt;| +---</span><br><span class="line">1&gt; 8| +--- (base class C)</span><br><span class="line">1&gt; 8| | +--- (base class A)</span><br><span class="line">1&gt; 8| | | a</span><br><span class="line">1&gt;| | +---</span><br><span class="line">1&gt;12| | c</span><br><span class="line">1&gt;| +---</span><br><span class="line">1&gt;+---</span><br></pre></td></tr></table></figure><h5 id="解释-6"><a href="#解释-6" class="headerlink" title="解释"></a>解释</h5><blockquote><p>我们可以看到D类的内存分布，出现了两个a成员，分别来源于B-&gt;A和C-&gt;A。</p></blockquote><h5 id="使用虚继承的虚基表解决问题"><a href="#使用虚继承的虚基表解决问题" class="headerlink" title="使用虚继承的虚基表解决问题"></a>使用虚继承的虚基表解决问题</h5><blockquote><p>改成下面的代码：</p></blockquote><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br></pre></td><td class="code"><pre><span class="line">class A</span><br><span class="line">&#123;</span><br><span class="line">public:</span><br><span class="line">int a;</span><br><span class="line">&#125;;</span><br><span class="line">class B : virtual public A</span><br><span class="line">&#123;</span><br><span class="line">public:</span><br><span class="line">int b;</span><br><span class="line">&#125;;</span><br><span class="line">class C : virtual  public A</span><br><span class="line">&#123;</span><br><span class="line">public:</span><br><span class="line">int c;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line">class D :public B, public C</span><br><span class="line">&#123;</span><br><span class="line"></span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure><p><img src="https://confusel-images.oss-cn-shenzhen.aliyuncs.com/%E5%8D%9A%E5%AE%A2%E5%9B%BE%E5%BA%93/%E8%99%9A%E5%87%BD%E6%95%B0/%E8%99%9A%E7%BB%A7%E6%89%BF%E8%A7%A3%E5%86%B3%E8%8F%B1%E5%BD%A2%E7%BB%A7%E6%89%BF.png" alt=""></p><center>不再报错</center><blockquote><p>查看内存分布</p></blockquote><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br><span class="line">52</span><br><span class="line">53</span><br><span class="line">54</span><br><span class="line">55</span><br><span class="line">56</span><br><span class="line">57</span><br><span class="line">58</span><br><span class="line">59</span><br></pre></td><td class="code"><pre><span class="line">1&gt;class Asize(4):</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt; 0| a</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;class Bsize(12):</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt; 0| &#123;vbptr&#125;</span><br><span class="line">1&gt; 4| b</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt;+--- (virtual base A)</span><br><span class="line">1&gt; 8| a</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;B::$vbtable@:</span><br><span class="line">1&gt; 0| 0</span><br><span class="line">1&gt; 1| 8 (Bd(B+0)A)</span><br><span class="line">1&gt;vbi:   class  offset o.vbptr  o.vbte fVtorDisp</span><br><span class="line">1&gt;               A       8       0       4 0</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;class Csize(12):</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt; 0| &#123;vbptr&#125;</span><br><span class="line">1&gt; 4| c</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt;+--- (virtual base A)</span><br><span class="line">1&gt; 8| a</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;C::$vbtable@:</span><br><span class="line">1&gt; 0| 0</span><br><span class="line">1&gt; 1| 8 (Cd(C+0)A)</span><br><span class="line">1&gt;vbi:   class  offset o.vbptr  o.vbte fVtorDisp</span><br><span class="line">1&gt;               A       8       0       4 0</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;class Dsize(20):</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt; 0| +--- (base class B)</span><br><span class="line">1&gt; 0| | &#123;vbptr&#125;</span><br><span class="line">1&gt; 4| | b</span><br><span class="line">1&gt;| +---</span><br><span class="line">1&gt; 8| +--- (base class C)</span><br><span class="line">1&gt; 8| | &#123;vbptr&#125;</span><br><span class="line">1&gt;12| | c</span><br><span class="line">1&gt;| +---</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt;+--- (virtual base A)</span><br><span class="line">1&gt;16| a</span><br><span class="line">1&gt;+---</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;D::$vbtable@B@:</span><br><span class="line">1&gt; 0| 0</span><br><span class="line">1&gt; 1| 16 (Dd(B+0)A)</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;D::$vbtable@C@:</span><br><span class="line">1&gt; 0| 0</span><br><span class="line">1&gt; 1| 8 (Dd(C+0)A)</span><br><span class="line">1&gt;vbi:   class  offset o.vbptr  o.vbte fVtorDisp</span><br><span class="line">1&gt;               A      16       0       4 0</span><br></pre></td></tr></table></figure><h5 id="解释-7"><a href="#解释-7" class="headerlink" title="解释"></a>解释</h5><blockquote><pre><code>1&gt;class D    size(20):1&gt;    +---1&gt; 0    | +--- (base class B)1&gt; 0    | | {vbptr}//起始偏移量地址为01&gt; 4    | | b1&gt;    | +---1&gt; 8    | +--- (base class C)1&gt; 8    | | {vbptr}//起始偏移量为81&gt;12    | | c1&gt;    | +---1&gt;    +---1&gt;    +--- (virtual base A) //这里存储了A类成员信息1&gt;16    | a//我们想要访问的成员 它在内存的偏移量为161&gt;    +---1&gt;1&gt;D::$vbtable@B@://D中的B虚基表，它记录了访问虚继承基类A的成员信息的内存偏移量1&gt; 0    | 01&gt; 1    | 16 (Dd(B+0)A)//偏移161&gt;1&gt;D::$vbtable@C@://D中的C虚基表，它记录了访问虚继承基类A的成员信息的内存偏移量1&gt; 0    | 01&gt; 1    | 8 (Dd(C+0)A)//偏移16</code></pre></blockquote><blockquote><p>我们看到B的虚基表指针的偏移量为0，而它要访问的虚基表显示偏移量为16。0+16=16。</p><p>C的虚基表指针的偏移量为8，而它要访问的虚基表显示偏移量为8。8+8=16。</p><p>显然他们都指向同一个内存偏移量为16的内容，即A类中的a成员。</p></blockquote><h5 id="分析-6"><a href="#分析-6" class="headerlink" title="分析"></a>分析</h5><blockquote><p>虚基表保存了虚继承基类成员的内存偏移量，访问的时候通过偏移访问，保证都是访问同一个数据。</p></blockquote><h2 id="总结"><a href="#总结" class="headerlink" title="总结"></a>总结</h2><blockquote><ol><li>无虚继承<ol><li>存在新的虚函数时，会创建一个虚函数表和虚函数表指针。</li><li>在多重继承中，最